; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj5 obj7 - airport
	obj1 obj6 - city
	obj3 obj12 obj15 - location
	obj4 obj8 obj9 obj11 - truck
	obj10 obj14 obj16 - package
	obj13 - airplane
)

(:init
	(at obj10 obj3)
	(in-city obj2 obj1)
	(in-city obj5 obj6)
	(in-city obj0 obj1)
	(at obj13 obj5)
	(in-city obj15 obj1)
	(at obj8 obj7)
	(at obj4 obj2)
	(in-city obj7 obj1)
	(in-city obj3 obj1)
	(at obj16 obj15)
	(at obj11 obj0)
	(at obj9 obj5)
	(at obj14 obj12)
	(in-city obj12 obj6)
)

(:goal (and
	(at obj16 obj12)
	(at obj14 obj3)
	(at obj10 obj12)
))
)

; plan
1. (fly obj13 obj5 obj0)
   deleted: (at obj13 obj5)
   added: (at obj13 obj0)
   goals met: 0 of 3
2. (drive obj9 obj5 obj12)
   deleted: (at obj9 obj5)
   added: (at obj9 obj12)
   goals met: 0 of 3
3. (load obj9 obj14 obj12)
   deleted: (at obj14 obj12)
   added: (in obj14 obj9)
   goals met: 0 of 3
4. (drive obj9 obj12 obj5)
   deleted: (at obj9 obj12)
   added: (at obj9 obj5)
   goals met: 0 of 3
5. (unload obj9 obj14 obj5)
   deleted: (in obj14 obj9)
   added: (at obj14 obj5)
   goals met: 0 of 3
6. (fly obj13 obj0 obj5)
   deleted: (at obj13 obj0)
   added: (at obj13 obj5)
   goals met: 0 of 3
7. (load obj13 obj14 obj5)
   deleted: (at obj14 obj5)
   added: (in obj14 obj13)
   goals met: 0 of 3
8. (fly obj13 obj5 obj7)
   deleted: (at obj13 obj5)
   added: (at obj13 obj7)
   goals met: 0 of 3
9. (unload obj13 obj14 obj7)
   deleted: (in obj14 obj13)
   added: (at obj14 obj7)
   goals met: 0 of 3
10. (load obj8 obj14 obj7)
   deleted: (at obj14 obj7)
   added: (in obj14 obj8)
   goals met: 0 of 3
11. (fly obj13 obj7 obj5)
   deleted: (at obj13 obj7)
   added: (at obj13 obj5)
   goals met: 0 of 3
12. (drive obj8 obj7 obj3)
   deleted: (at obj8 obj7)
   added: (at obj8 obj3)
   goals met: 0 of 3
13. (unload obj8 obj14 obj3)
   deleted: (in obj14 obj8)
   added: (at obj14 obj3)
   goals met: 1 of 3
14. (load obj8 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj8)
   goals met: 1 of 3
15. (drive obj8 obj3 obj0)
   deleted: (at obj8 obj3)
   added: (at obj8 obj0)
   goals met: 1 of 3
16. (unload obj8 obj10 obj0)
   deleted: (in obj10 obj8)
   added: (at obj10 obj0)
   goals met: 1 of 3
17. (drive obj4 obj2 obj15)
   deleted: (at obj4 obj2)
   added: (at obj4 obj15)
   goals met: 1 of 3
18. (load obj4 obj16 obj15)
   deleted: (at obj16 obj15)
   added: (in obj16 obj4)
   goals met: 1 of 3
19. (drive obj4 obj15 obj0)
   deleted: (at obj4 obj15)
   added: (at obj4 obj0)
   goals met: 1 of 3
20. (unload obj4 obj16 obj0)
   deleted: (in obj16 obj4)
   added: (at obj16 obj0)
   goals met: 1 of 3
21. (fly obj13 obj5 obj0)
   deleted: (at obj13 obj5)
   added: (at obj13 obj0)
   goals met: 1 of 3
22. (load obj13 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj13)
   goals met: 1 of 3
23. (load obj13 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj13)
   goals met: 1 of 3
24. (fly obj13 obj0 obj5)
   deleted: (at obj13 obj0)
   added: (at obj13 obj5)
   goals met: 1 of 3
25. (unload obj13 obj16 obj5)
   deleted: (in obj16 obj13)
   added: (at obj16 obj5)
   goals met: 1 of 3
26. (load obj9 obj16 obj5)
   deleted: (at obj16 obj5)
   added: (in obj16 obj9)
   goals met: 1 of 3
27. (unload obj13 obj10 obj5)
   deleted: (in obj10 obj13)
   added: (at obj10 obj5)
   goals met: 1 of 3
28. (load obj9 obj10 obj5)
   deleted: (at obj10 obj5)
   added: (in obj10 obj9)
   goals met: 1 of 3
29. (drive obj9 obj5 obj12)
   deleted: (at obj9 obj5)
   added: (at obj9 obj12)
   goals met: 1 of 3
30. (unload obj9 obj16 obj12)
   deleted: (in obj16 obj9)
   added: (at obj16 obj12)
   goals met: 2 of 3
31. (unload obj9 obj10 obj12)
   deleted: (in obj10 obj9)
   added: (at obj10 obj12)
   goals met: 3 of 3
